# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [3]:
#Write your code here
import pandas as pd 
df=pd.read_csv("Purchase_Data.csv")
df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [5]:
#Write your code here
df.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [7]:
#Write you code here
result_1=df.loc[:,['invoice_number','invoice_time']]
print(result_1)

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [9]:
#Write you code here
result_2=df.loc[0:1,:]
print(result_2)

   invoice_number   invoice_time store_id  product_id  category_id  num_item  \
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101       1.0
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0

   price
0    2.0
1    2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [11]:
#Write your code here
result_3=df.loc[0:3,"invoice_number":"category_id"]
print(result_3)

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [13]:
#Write your code here
result_4=df.loc[[0,4,6],['invoice_time','price']]
print(result_4)

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [15]:
num_rows = len(df)
print(num_rows)

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [17]:
#Write your code here
df.tail(1)

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [20]:
#Write your code here
avg_price= df["price"].mean() 
print(avg_price)
max_price= df["price"].max() 
print(max_price)

3.1920522110741363
6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [22]:
#Write you code here
mean_values = df[['price', 'num_item']].mean()
print(mean_values)
avg_price=3.192052
avg_num_items=1.298309

price       3.192052
num_item    1.298309
dtype: float64

Create a column called "total", which is the product of the price and num_item columns.

In [24]:
#Write your code here
df["total"]=df.price * df.num_item
df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the avgerage price of the three most expensive purchases?

In [26]:
#Write your code here
df.nlargest(3, 'total')
avg_price= df.loc[[4510,3784,4288],["total"]].mean() 
print(avg_price)

total    164.0
dtype: float64

How many different products are there?

In [28]:
#Write your code here
df["product_id"].unique()

array([ 7000300,  7070884,  7070891,  7090363,  7000126,  7308017,
       15000231,  7071096,  7000133,  7071133,  7314599,  7000294,
        7313684,  7071218,  7314612,  7090370, 21000782, 30000742,
        7308765,  7000140,  7070969, 21000430,  7000034,  7000423,
       21050107, 20098391, 30000759, 30000766,  7000409,  7090097,
        7071102,  7071140,  7071164,  7000416, 21000447, 21000379,
       21000362, 30000711,  7090462,  7090509,  7071331, 21050060,
       21050022,  7090455,  7090592, 23030206,  7090493,  7071256,
        7071249,  7090486,  7090479,  7071232,  7090615], dtype=int64)

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [30]:
#Write your code here
mean=df["total"].mean()
print(mean)
median=df["total"].median()
print(median)
print(mean-median)

3.931807878112784
3.0
0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [32]:
#Write your code here
df.drop(columns=['total'])
df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [34]:
#Write your code here

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [36]:
#Write your code here
df['invoice_time'] = pd.to_datetime(df['invoice_time'])
df.info()

C:\Users\hp\AppData\Local\Temp\ipykernel_28044\2185155895.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['invoice_time'] = pd.to_datetime(df['invoice_time'])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5382 entries, 0 to 5381
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_number  5382 non-null   float64
 1   invoice_time    5382 non-null   datetime64[ns]
 2   store_id        5382 non-null   object
 3   product_id      5382 non-null   int64
 4   category_id     5382 non-null   int64
 5   num_item        5382 non-null   float64
 6   price           5382 non-null   float64
 7   total           5382 non-null   float64
dtypes: datetime64[ns](1), float64(4), int64(2), object(1)
memory usage: 336.5+ KB

In [37]:
df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,6.0

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [39]:
#Write your code here
date_col=pd.DatetimeIndex(df['invoice_time'])
df['DOW']=date_col.day
df['Month']=date_col.month
df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,2.0,15,7
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,2.0,15,7
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,2.0,15,7
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,6.0,15,7
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,6.0,15,7

In [40]:
df['Dayname']= df['invoice_time'].dt.day_name()
print(df)

      invoice_number        invoice_time store_id  product_id  category_id  \
0       2.020000e+11 2015-07-15 10:45:00     G816     7000300       210101
1       2.020000e+11 2015-07-15 12:16:00     G816     7070884        70203
2       2.020000e+11 2015-07-15 12:16:00     G816     7070884        70203
3       2.020000e+11 2015-07-15 12:16:00     G816     7070891        70401
4       2.020000e+11 2015-07-15 12:16:00     G816     7090363        70401
...              ...                 ...      ...         ...          ...
5377    2.020000e+11 2015-09-05 23:07:00      300     7308017       210101
5378    2.020000e+11 2015-09-05 23:23:00     G619     7070891        70401
5379    2.020000e+11 2015-09-05 23:24:00     G619     7071096        70201
5380    2.020000e+11 2015-09-05 23:32:00     G619    15000231        70301
5381    2.020000e+11 2015-09-05 23:38:00     G619    23030206       210101

      num_item  price  total  DOW  Month    Dayname
0          1.0    2.0    2.0   15      7  Wednesday
1          1.0    2.0    2.0   15      7  Wednesday
2          1.0    2.0    2.0   15      7  Wednesday
3          1.0    6.0    6.0   15      7  Wednesday
4          1.0    6.0    6.0   15      7  Wednesday
...        ...    ...    ...  ...    ...        ...
5377       1.0    3.0    3.0    5      9   Saturday
5378       1.0    6.0    6.0    5      9   Saturday
5379       1.0    5.0    5.0    5      9   Saturday
5380       2.0    2.0    4.0    5      9   Saturday
5381       1.0    2.0    2.0    5      9   Saturday

[5382 rows x 11 columns]

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [42]:
#Write your code here
#df['DOW'].value_counts()
dayname_counts=df.value_counts("Dayname")
num_purchases_wed=dayname_counts.get("Wednesday",0)
print(num_purchases_wed)

959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [45]:
#Write your code here
df=pd.read_csv("Titanic.csv")
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [47]:
#Write your code here
df.rename(columns={'Name': 'Passenger_Name', 'Ticket': 'Ticket_Num'}, inplace=True)
df.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [49]:
#Write your code here
df.set_index('PassengerId')

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...
1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

Select the name of passenger 896

In [51]:
#Write your code here
passenger_896 = df[df["PassengerId"] == 896]
passenger_name = passenger_896["Passenger_Name"].values[0]
print(passenger_name)

Hirvonen, Mrs. Alexander (Helga E Lindqvist)

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [53]:
#Write your code here
df.reset_index(drop=True)

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [55]:
#Write you code here
df.isnull().sum()

PassengerId         0
Pclass              0
Passenger_Name      0
Sex                 0
Age                86
SibSp               0
Parch               0
Ticket_Num          0
Fare                1
Cabin             327
Embarked            0
dtype: int64

Compute the avg age of passengers ignoring the missing data.

In [57]:
#Write your code here
Average_age = df["Age"].mean(numeric_only=True)
print(Average_age)

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [59]:
#Write your code here
df["Age"].fillna(df["Age"].mean(numeric_only=True),inplace=True) 
df.tail()

C:\Users\hp\AppData\Local\Temp\ipykernel_28044\2496416258.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(df["Age"].mean(numeric_only=True),inplace=True)

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
413,1305,3,"Spector, Mr. Woolf",male,30.27259,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.00000,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.50000,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,30.27259,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,30.27259,1,1,2668,22.3583,NaN,C

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [61]:
#Write your code here
df.nlargest(5, 'Age')
avg_age= df.loc[[96,81,179,236,305],["Age"]].mean() 
print(avg_age)

Age    67.0
dtype: float64